{
    "experience": {
        "title": "Experiencia",
        "companies": [
            {
                "name": "DaCodes",
                "mode": "Remoto",
                "role": "Senior Software Engineer",
                "duration": "Ago 2024 - Oct 2025",
                "description": "Participé en el diseño, migración y escalamiento de un Enterprise Financial Portal (Fintech, Mortgage Lending) y en el desarrollo de una Music & Entertainment Events Web Application, ambos basados en microservices architecture, con enfoque en backend development, payments & billing, security, testing y CI/CD.",
                "details": [
                    "Migración de arquitecturas monolíticas a microservicios, diseñando flujos UML / BPM y  documentación técnica.",
                    "Fortalecimiento de la seguridad de aplicaciones web, remediando hasta el 98% de vulnerabilidades detectadas",
                    "Análisis de calidad y seguridad con SonarQube y Fortify",
                    "Desarrollo de microservicios y REST APIs con TypeScript, Node.js, Express y NestJS, aplicando patrones de diseño",
                    "Modelado de datos y gestión de bases relacionales con PostgreSQL y TypeORM",
                    "Integración de módulos web con JavaScript, React y TypeScript",
                    "Implementación y optimización de flujos de pago con Stripe",
                    "Implementación de procesos en segundo plano con CRON Jobs para actualización de estados de pago",
                    "Automatización de pruebas unitarias (Jest) y end-to-end (Cypress), además de diseño y ejecución de pruebas funcionales",
                    "Participación activa en pipelines CI/CD y despliegue de servicios usando GitFlow con Git, GitLab/GitHub, Jenkins, Docker y AWS EC2",
                    "Colaboración y comunicación continua con equipos multidisciplinarios, incluyendo MQ, CRM, SAP y Business stakeholders, para asegurar la correcta alineación entre requerimientos técnicos y de negocio"
                ]
            },
            {
                "name": "Prointernet MX",
                "mode": "Presencial",
                "role": "Backend Developer | Team Leadership & Mentorship",
                "duration": "Jun 2019 - Jun 2024",
                "description": "Colabore en la construcción de E-Commerce Platforms (B2C / B2B),  Event Management Systems (EventTech Solutions) y Logistics Management System, enfocadas en alto volumen de usuarios, integración de pagos, facturación en línea, seguridad y arquitecturas escalables. Realice mentoría técnica y apoyo en la gestión del equipo.",
                "details": [
                    "Diseño y modelado de bases de datos con SQL Server y MySQL (DDL/DML)",
                    "Integración de pasarelas de pago: BBVA, Banorte, Clip, PayPal",
                    "Implementación de facturación electrónica CFDI 3.3 y 4.0 con RealVirtual (PAC)",
                    "Desarrollo de procesos ETL con MSSQL Bulk y Node.js (Cron Jobs)",
                    "Construcción de carritos de compra persistentes y actualizaciones en tiempo real con WebSockets",
                    "Desarrollo de módulos de pre-registro y pagos con Clip y conciliación mediante Webhooks",
                    "Implementación de control de acceso con QR y NFC",
                    "Desarrollo de módulos de check-in online/offline con Electron.js",
                    "Creación de dashboards con JavaScript, React.js y Google Charts",
                    "Diseño de REST APIs seguras con JavaScript, TypeScript, TypeORM, JWT y RSA/RS256",
                    "Desarrollo de sistemas de gestión de paquetería (TMS) y módulos POS con JavaScript, React.js y Electron.js",
                    "Remediación de vulnerabilidades detectadas por herramientas como Tenable, de hasta un 100%",
                    "Implementación de políticas de seguridad: CSP, Permissions-Policy, Cache-Control, etc",
                    "Gestión de repositorios con Git, GitHub y despliegue en Azure"
                ]
            },
            {
                "name": "Grupo Crea",
                "mode": "Remoto",
                "role": "Backend Developer",
                "duration": "Feb 2022 - May 2022",
                "description": "Desarrollador backend en una aplicación móvil de radio digital, encargado de implementar APIs para transmisión en vivo, publicación de noticias y gestión de anuncios publicitarios.",
                "details": [
                    "Diseño e implementación de REST APIs para live streaming, news publishing y advertising management",
                    "Desarrollo backend utilizando JavaScript, TypeScript, Node.js y Express",
                    "Despliegue, operación y mantenimiento de servicios en DigitalOcean, Git y GitHub"
                ]
            }
        ]
    },
    "skills": {
        "title": "Habilidades",
        "skills": [
            {
                "title": ""
            }
        ]
    },
    "knowledges": {
        "title": "Conocimientos",
        "skills": [
            {
                "title": ""
            }
        ]
    },
    "projects": {
        "title": "Proyectos tecnologicos",
        "skills": [
            {
                "title": "Plataformas de Comercio Electrónico Escalables"
            },
            {
                "title": "Sistemas de Facturación Electrónica CFDI 4.0"
            },
            {
                "title": "Soluciones de Logística y Gestión de Paquetería"
            },
            {
                "title": "Sistemas de Gestión de Contenidos (CMS)"
            },
            {
                "title": "Plataformas para Eventos Corporativos y Networking"
            },
            {
                "title": "Sistemas de Punto de Venta (POS)"
            },
            {
                "title": "Plataformas de Radio Digital y Streaming"
            },
            {
                "title": "Sistemas Financieros e Inmobiliarios"
            }
        ]
    },
    "profile": {
        "title": "Perfil",
        "skills": [
            {
                "title": "Desarrollo Backend Escalable y APIs RESTful",
                "level": 92
            },
            {
                "title": "Diseño y Optimización de Bases de Datos",
                "level": 88
            },
            {
                "title": "Arquitectura de Software y Microservicios",
                "level": 85
            },
            {
                "title": "Integraciones de Sistemas y Pasarelas de Pago",
                "level": 80
            },
            {
                "title": "Automatización de Procesos y ETL",
                "level": 78
            },
            {
                "title": "Desarrollo Frontend Moderno y Responsivo",
                "level": 75
            }
        ]
    }
}